{
  "publishedAt": "28th Jan 2022",
  "title": "cookie-clicker",
  "content": "Cookie Clicker is an incremental game created by French programmer Julien (Orteil) Thiennot in 2013. The user initially clicks on a big cookie on the screen, earning a single cookie per click. They can then spend their earned cookies upon purchasing assets such as cursors and other buildings that automatically produce cookies. Upgrades are also available and can improve the efficiency of clicks and buildings, among many other mechanics that allow the user to earn cookies in different ways. Though the game has no ending,[1] it has hundreds of achievements, and users may aim to reach milestone numbers of cookies.The game has a dedicated fanbase. Though the original version was coded in one night, Cookie Clicker is regularly updated. It has been widely described as addictive, and has been credited with playing a role in the emergence of idle gaming." ,
"At first, the player clicks on a large cookie on the far left side of the screen, earning one cookie per click. With these cookies, the player can buy new assets such as cursors, grandmas, farms, mines, factories, banks, temples, and many more that automatically make cookies without needing to click. Prices increase exponentially, each asset costing 15% more than the last-purchased asset of the same type. The player may also purchase upgrades to increase cookie production for these buildings. Golden cookies, small cookies that appear in random locations and fade away after several seconds, appear periodically and grant effects, such as a temporary increase in the rate of production, if clicked before they disappear. After earning a certain number of cookies, the player can 'ascend', losing their progress but earning heavenly chips and prestige levels. Prestige levels add a permanent boost (+1% per level) to the rate of cookie production in future play-throughs, while heavenly chips can be spent on a wide variety of prestige upgrades. However, the number of cookies needed to unlock the next prestige level goes up proportionally with the cube of the level, becoming harder to attain as more are acquired. Other game mechanics include wrinklers (eldritch beasts which reduce cookie production, but can be popped by clicking them, returning all the cookies it digested with interest), Krumblor the Cookie Dragon, mini games, and sugar lumps (which take 24 hours to coalesce and are used to level up buildings and boost their production rate).",
"Achievements can be earned by completing various tasks or goals, such as reaching a certain number of total cookies produced, owning a particular number of buildings of a certain type or clicking a certain number of golden cookies. Upon reaching a certain number of achievements, the player unlocks different colors of milk that appear below the cookie. With kitten upgrades, the player earns extra production depending on their total achievements. Additionally, seasonal events occur during their respective holidays which come with more upgrades and cookies to unlock. The game features geometric growth: the player begins baking handfuls of cookies, but can quickly reach billions of cookies, and eventually attain duodecillions (1039) of cookies or beyond. The game has no clear ending.Because of the game's relatively simple code, cheats and add-ons are widely available and simply implemented by using browser consoles and bookmarklets. (https://en.wikipedia.org/wiki/Cookie_Clicker).",
  "featuredImage": "https://user-images.githubusercontent.com/67590020/86011115-ecfb0f00-ba39-11ea-8f82-be29c6b827db.png"
}
